app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$VhS.Ju0O4SsU.Nix4UEfQ.IDrwZKk6o5zhfCdeCnBYl3Y1FOAM9Xy"], ["updated_at", "2015-03-07 09:04:49.475380"], ["id", 1]]
---
  def update
    if password_blank?
      flash.now[:danger] = "Password can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)